unsteady/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    inlet
    {
        type            fixedValue;
        value           uniform (8 0 0);
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (8 0 0);
        value           $internalField;
    }

    north
    {
        type            symmetryPlane;
    }
    south
    {
        type            symmetryPlane;
    }
    top
    {
        type            symmetryPlane;
    }
    bottom
    {
        type            symmetryPlane;
    }

    rotor
    {
        type            movingWallVelocity;
        value           $internalField;
    }

    nonCouple
    {
        type            movingWallSlipVelocity;
        value           $internalField;
    }
}
// ************************************************************************* //
