unsteady/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    north
    {
        type            symmetryPlane;
    }
    south
    {
        type            symmetryPlane;
    }
    top
    {
        type            symmetryPlane;
    }
    bottom
    {
        type            symmetryPlane;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    rotor
    {
        type            calculated;
        value           nonuniform List<scalar> 
30237
(
20.5981
65.2641
36.7339
42.4021
73.7443
12.4728
70.1705
66.5779
...
)
;
    }
    nonCouple1
    {
        type            calculated;
        value           uniform 0;
    }
    nonCouple2
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
