unsteady/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Whether to convert internal faces only, and ignore any boundary faces that
// are in the selection
internalFacesOnly true;

// Example creating two opposing patches named 'nonCouple1' and 'nonCouple2',
// both of which are included in the 'nonCouple' group. These patches can then
// be coupled afterwards by calling 'createNonConformalCouples -overwrite
// nonCouple1 nonCouple2'.
baffles
{
    nonCouple
    {
        type        faceZone;
        zoneName    face_inner;

        owner
        {
            name        nonCouple1;
            type        patch;
        }

        neighbour
        {
            name        nonCouple2;
            type        patch;
        }
    }
}

// ************************************************************************* //
